# Code-search similar to ack https://github.com/ggreer/the_silver_searcher
brew "ag"

# Search tool like grep, but optimized for programmers http://beyondgrep.com/
brew "ack"

# The fastest shell plugin manager http://getantibody.github.io
brew "getantibody/tap/antibody"

# Official Amazon AWS command-line interface https://aws.amazon.com/cli/
brew "awscli"

# Tool for generating GNU Standards-compliant Makefiles https://www.gnu.org/software/automake/
brew "automake"

# Install Bash 4
brew "bash"

# Programmable completion for Bash 3.2 https://bash-completion.alioth.debian.org/
brew "bash-completion"

# open source secrets management https://bitwarden.com/
brew "bitwarden-cli"

# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript https://clang.llvm.org/docs/ClangFormat.html
brew "clang-format"

# Command-line tool for Amazon Route 53 https://github.com/barnybug/cli53
brew "cli53"

# GNU File, Shell, and Text utilities https://www.gnu.org/software/coreutils
brew "coreutils"

# direnv is an environment switcher for the shell.
brew "direnv"

# Convert text between DOS, UNIX, and Mac formats https://waterlan.home.xs4all.nl/dos2unix.html
brew "dos2unix"

# Evans: more expressive universal gRPC client https://evans.syfm.me
brew "ktr0731/evans/evans"

# XML-based font configuration API for X Windows https://wiki.freedesktop.org/www/Software/fontconfig/
brew "fontconfig"

# need fontconfig to install/build fonts
# Identify or delete duplicate files https://github.com/adrianlopezroche/fdupes
brew "fdupes"

# Collection of GNU find, xargs, and locate https://www.gnu.org/software/findutils/
brew "findutils"

# GNU awk utility https://www.gnu.org/software/gawk/
brew "gawk"

# Access GitHub's .gitignore boilerplates https://github.com/simonwhitaker/gibo
brew "gibo"

# Distributed revision control system https://git-scm.com
brew "git"

# enable transparent encryption/decryption fo files in a git repo https://www.agwa.name/projects/git-crypt/
brew "git-crypt"

# Extensions to follow Vincent Driessen's branching model https://github.com/nvie/gitflow
brew "git-flow"

# GNU Pretty Good Privacy (PGP) package https://gnupg.org/
brew "gnupg", link: false

# GNU implementation of the famous stream editor https://www.gnu.org/software/sed/
brew "gnu-sed", args: [ "--with-default-names" ]

# GNU implementation of which utility https://savannah.gnu.org/projects/which/
brew "gnu-which"

# Open source programming language to build simple/reliable/efficient software https://golang.org
brew "go"

# Command-line Golang template processor https://gomplate.hairyhenderson.ca/
brew "gomplate"

# release automation tool for Go projects https://goreleaser.com/
brew "goreleaser/tap/goreleaser"

# GNU grep, egrep and fgrep https://www.gnu.org/software/grep/
brew "grep"

# Improved top (interactive process viewer) https://hisham.hm/htop/
brew "htop"

# Add GitHub support to git on the command-line https://hub.github.com/
brew "hub"

# Configurable static site generator https://gohugo.io/
brew "hugo"

# Tools and libraries to manipulate images in many formats https://www.imagemagick.org/
brew "imagemagick"

# Tool to capture still images from an iSight or other video source https://iharder.sourceforge.io/current/macosx/imagesnap/
brew "imagesnap"

# Command-line application launcher for the iOS Simulator https://github.com/phonegap/ios-sim
brew "ios-sim"

# CLI wrapper for basic network utilities on Mac OS X inspired with iproute2 on Linux systems https://github.com/brona/iproute2mac
brew "iproute2mac"

# Manage your Java environment https://www.jenv.be/
brew "jenv"

# Lightweight and flexible command-line JSON processor https://stedolan.github.io/jq/
brew "jq"

# Sophisticated file transfer program https://lftp.yar.ru/
brew "lftp"

# Utility for directing compilation https://www.gnu.org/software/make/
brew "make"

# A simple command line interface for the Mac App Store.
brew "mas"

# Powerful paging program http://www.jedsoft.org/most/
brew "most"

# Collection of tools that nobody wrote when UNIX was young https://joeyh.name/code/moreutils/
brew "moreutils"

# CLI for MySQL with auto-completion and syntax highlighting http://mycli.net/
brew "mycli"

# Utility for managing network connections https://netcat.sourceforge.io/
brew "netcat"

# Port scanning utility for large networks https://nmap.org/
brew "nmap"

# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension https://openvpn.net/index.php/download/community-downloads.html
brew "openvpn"

# Tool for creating identical machine images for multiple platforms https://packer.io
brew "packer"

# Protocol buffers (Google's data interchange format) https://github.com/protocolbuffers/protobuf/
brew "protobuf"

# Show ps output as a tree http://www.thp.uni-duisburg.de/pstree/
brew "pstree"

# Monitor data's progress through a pipe https://www.ivarch.com/programs/pv.shtml
brew "pv"

# Python version management https://github.com/pyenv/pyenv
brew "pyenv"

# Pyenv plugin to manage virtualenv https://github.com/pyenv/pyenv-virtualenv
brew "pyenv-virtualenv"

# Library for command-line editing https://tiswww.case.edu/php/chet/readline/rltop.html
brew "readline"

# Utility that provides fast incremental file transfer https://rsync.samba.org/
brew "rsync"

# Terminal multiplexer with VT100/ANSI terminal emulation https://www.gnu.org/software/screen
brew "screen"

# Static analysis and lint tool, for (ba)sh scripts https://www.shellcheck.net/
brew "shellcheck"

# Tool to build, change, and version infrastructure https://www.terraform.io/
brew "terraform"

# Tool to generate documentation from Terraform modules https://github.com/segmentio/terraform-docs
brew "terraform-docs"

# Terraform State → Ansible Dynamic Inventory https://github.com/adammck/terraform-inventory
brew "terraform-inventory"

# Ansible provisioner for Terraform https://github.com/jonmorehouse/terraform-provisioner-ansible
brew "terraform-provisioner-ansible"

# Text interface for Git repositories http://jonas.nitro.dk/tig/
brew "tig"

# Terminal multiplexer https://tmux.github.io/
brew "tmux"

# CLI tool that moves files or folder to the trash https://hasseg.org/trash/
brew "trash"

# Display directories as trees (with optional color/HTML output) http://mama.indstate.edu/users/ice/tree/
brew "tree"

# Terminal interaction recorder and player http://0xcc.net/ttyrec/
brew "ttyrec"

# Executes a program periodically, showing output fullscreen https://gitlab.com/procps-ng/procps
brew "watch"

# Watch files and take action when they change https://github.com/facebook/watchman
brew "watchman"

# Internet file retriever https://www.gnu.org/software/wget/
brew "wget", arge: [ "--with-iri" ]

# JavaScript package manager https://yarnpkg.com/
brew "yarn"

# YubiKey personalization library and tool https://developers.yubico.com/yubikey-personalization/
brew "ykpers"

# UNIX shell (command interpreter) https://www.zsh.org/
brew "zsh"

# Additional completion definitions for zsh https://github.com/zsh-users/zsh-completions
brew "zsh-completions"

#########################
# CLI Applications
#########################

# https://github.com/99designs/aws-vault
cask "aws-vault"

# https://btcarmory.com/
cask "armory"

# https://bitwarden.com/
cask "bitwarden"

# Dash gives your Mac instant offline access to 200+ API documentation sets. https://kapeli.com/dash
cask "dash"

# https://www.sourcegear.com/diffmerge/
cask "diffmerge"

# https://www.docker.com/community-edition
cask "docker"

# https://www.dropbox.com/
cask "dropbox"

tap "homebrew/cask-fonts"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"

# https://www.gimp.org/
cask "gimp"

# Google Chrome web Browser https://www.google.com/chrome/
cask "google-chrome"

# http://growl.info/downloads
cask "growlnotify"

# https://gpgtools.org/
cask "gpg-suite"

# itsycal is a nice menu bar clock replacement that features a calendar with events from iCal https://www.mowglii.com/itsycal/
cask "itsycal"

# https://www.iterm2.com/
cask "iterm2"

# https://keybase.io/
cask "keybase"

# http://kicad-pcb.org/
cask "kicad"

# https://www.amazon.com/gp/digital/fiona/kcp-landing-page
cask "kindle"

# a markdown editor https://macdown.uranusjr.com/
cask "macdown"

# https://signal.org/
cask "signal"

# slack team chat https://slack.com/
cask "slack"

# osx window management/tiling https://www.spectacleapp.com/
cask "spectacle"

# multiformat decompression utility https://theunarchiver.com/
cask "the-unarchiver"

# https://www.git-tower.com/
# cask "tower"

# bittorrent client https://transmissionbt.com/
cask "transmission"

# VPN client https://www.tunnelblick.net/
cask "tunnelblick"

# https://www.vagrantup.com/
cask "vagrant"

# virtualbox to handle virtual machines
cask "virtualbox"
cask "virtualbox-extension-pack"

# https://code.visualstudio.com/
cask "visual-studio-code"

# https://www.videolan.org/vlc/
cask "vlc"

# https://www.xquartz.org/
cask "xquartz"

#########################
# Apple App Store purchases
#########################

mas "1Password", id: 443987910
mas "AppDelete Lite", id: 451960925
mas "Apple Configurator 2", id: 1037126344
mas "DaisyDisk", id: 411643860
mas "iMovie", id: 408981434
mas "iShowU-Instant", id: 1065398765
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Quiver", id: 866773894
mas "Transmit", id: 403388562
mas "Trello", id: 1278508951
mas "VisualJSON", id: 488709442
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
